test/datadictionary/GetPostRequest/1/sayHelloInput/1.json

{"sayHelloInput":{"description":"Input message for wsdl operation sayHello","x-ibm-schema":{"wsdl-message-direction-or-name":"sayHelloRequest","wsdl-operation":"sayHello","wsdl-port":"{http://www.examples.com/wsdl/HelloService.wsdl}Hello_Port"},"type":"object","example":"\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">\n <soapenv:Header>\n  <!-- The Security element should be removed if WS-Security is not enabled on the SOAP target-url -->\n  <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n   <wsse:UsernameToken>\n    <wsse:Username>string</wsse:Username>\n    <wsse:Password>string</wsse:Password>\n    <wsse:Nonce EncodingType=\"string\">string</wsse:Nonce>\n    <wsu:Created>string</wsu:Created>\n   </wsse:UsernameToken>\n   <wsu:Timestamp wsu:Id=\"string\">\n    <wsu:Created>string</wsu:Created>\n    <wsu:Expires>string</wsu:Expires>\n   </wsu:Timestamp>\n  </wsse:Security>\n </soapenv:Header>\n <soapenv:Body>\n  <tns:sayHello xmlns:tns=\"http://www.examples.com/wsdl/HelloService.wsdl\"><!-- mandatory -->\n   <tns:firstName>string</tns:firstName>\n  </tns:sayHello>\n </soapenv:Body>\n</soapenv:Envelope>","properties":{"Envelope":{"xml":{"prefix":"soapenv","namespace":"http://schemas.xmlsoap.org/soap/envelope/"},"type":"object","required":true,"properties":{"Header":{"$ref":"#/definitions/sayHelloHeader"},"Body":{"xml":{"prefix":"soapenv","namespace":"http://schemas.xmlsoap.org/soap/envelope/"},"type":"object","required":true,"properties":{"sayHello":{"$ref":"#/definitions/SayHelloRequest_tns","required":true}}}}}}},"definitions":{}}